content/euler/52.md
+++
title = "Project Euler 52: Permuted Multiples"
author = ["Gautam Manohar"]
description = "My solution to problem 52 of Project Euler."
date = 2018-07-16
tags = ["brute-force"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

It can be seen that the number \\(125874\\) and its double, \\(251748\\), contain
exactly the same digits, but in a different order. Given \\(N\\), find all the
positive integers up \\(x \le N\\) such that \\(2x,3x,\ldots,Kx\\) contain the same
digits.


## My Algorithm {#my-algorithm}

To check whether two strings are permutations of each other, we can check if
they are equal after sorting. To check whether an array contains only strings
that are permutations of each other, we take the first element of the array and
apply the above procedure to each other string in the array. For each \\(125874
\le n \le N\\), we create an array of the first \\(K\\) multiples of \\(n\\). We use the
described procedure to check if they all contain the same digits. To speed this
up, we only proceed with \\(n\\) if \\(n\\) and \\(Kn\\) contain the same number of digits.
A further optimization is to check that each digit of \\(n\\) is unique.